{
  "stories": [
    "_Little Red Riding Hood_ by **James Finn Garner**\n\nThere was once a young person named Red Riding Hood who lived with her mother on the edge of a large wood. One day her mother asked her to take a basket of fresh fruit and mineral water to her grandmother's house – not because this was womyn's work, mind you, but because the deed was generous and helped engender a feeling of community. Furthermore, her grandmother was not sick, but rather was in full physical and mental health and was fully capable of taking care of herself as a mature adult.\nSo Red Riding Hood set off with her basket through the woods. Many people believed that the forest was a foreboding and dangerous place and never set foot in it. Red Riding Hood, however, was confident enough in her own budding sexuality that such obvious Freudian imaginery did not intimidate her.\nOn the way to Grandma's house, Red Riding Hood was accosted by a wolf, who asked her what was in her basket. She replied, \"Some healthful snacks for my grandmother, who is certainly capable of taking care of herself as a mature adult.\"\nThe wolf said, \"You know, my dear, it isn't safe for a little girl to walk through these woods alone.\"\nRed Riding Hood said, \"I find your sexist remark offensive in the extreme, but I will ignore it because of your traditional status as an outcast from society, the stress of which has caused you to develop your own, entirely valid, worldview. Now, if you'll excuse me, I must be on my way.\"\nRed Riding Hood walked on along the main path. But, because his status outside society has freed him from slavish adherence to linear, Western-style thought, the wolf knew a quicker route to Grandma's house. He burst into the house and ate Grandma, an entirely valid course of action for a carnivore such as himself. Then, unhampered by rigid, traditionalist notions of what was masculine or feminine, he put on Grandma's nightclothes and crawled into bed.\nRed Riding Hood entered the cottage and said, \"Grandma, I have brought you some fat-free, sodium-free snacks to salute you in your role of a wise and nurturing matriarch.\"\nFrom the bed, the wolf said softly, \"Come closer, child, so that I might see you.\"\nRed Riding Hood said, \"Oh, I forgot you are as optically challenged as a bat. Grandma, what big eyes you have!\"\n\"They have seen much, and forgiven much, my dear.\"\n\"Grandma, what a big nose you have –only relatively, of course, and certainly attractive in its own way.\"\n\"It has smelled much, and forgiven much, my dear.\"\n\"Grandma, what big teeth you have!\"\nThe wolf said, \"I am happy with who I am and what I am,\" and leaped out of bed. He grabbed Red Riding Hood in his claws, intent on devouring her. Red Riding Hood screamed, not out of alarm at the wolf's apparent tendency toward cross-dressing, but because of his willful invasion of her personal space.\nHer screams were heard by a passing woodchopper-person (or log-fuel technician, as he preferred to be called). When he burst into the cottage, he saw melee thereand tried to intervene. But as he raised his ax, Red Riding Hood and the wolf both stopped.\n\"And just what do you think you're doing?\" asked Red Riding Hood.\nThe woodchopper-person blinked and tried to answer, but no words came to him.\n\"Bursting in here like a Neanderthal, trusting your weapon to do your thinking for you!\" she exclaimed. \"Sexist! Speciesist! How dare you assume that womyn and wolves can't solve their own problems without a man's help!\"\nWhen she heard Red Riding Hood's impassioned speech, Grandma jumped out of the Wolf's mouth, took the woodchopper-person's ax, and cut his head off. After this ordeal, Red Riding Hood, Grandma, and the Wolf felt a certain commonality of purpose. They decided to set up an alternative household based on mutual respect and cooperation, and they lived together in the woods happily ever after."
  ]
}